In this week's challenge, I will attempt to tame this dataset, by drawing correlation between timestamps, whether the content was shared or not, and the view count. We can start by importing the data first.

In [50]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [51]:
dataset = pd.read_csv('BX-Users.csv', encoding='ISO-8859–1', on_bad_lines='skip')

In [52]:
!wc -l BX-Book-Ratings.csv

 1149781 BX-Book-Ratings.csv

In [53]:
!tail -1149781 BX-Book-Ratings.csv > BX-Book-Ratings-Clean.csv

In [71]:
#Some idiosyncracies with the data require me to skip bad lines and seperate columns manually
#Luckily pandas has built in arguments for this when reading in data.

ratings = pd.read_csv('BX-Book-Ratings-Clean.csv', encoding='ISO-8859–1',on_bad_lines='skip',quotechar='"',sep=";",escapechar= "\\")
books = pd.read_csv('BX_Books.csv', encoding='ISO-8859–1',on_bad_lines='skip',quotechar='"',sep=";",escapechar= "\\")
users = pd.read_csv('BX-Users.csv', encoding='ISO-8859–1',on_bad_lines='skip',quotechar='"',sep=";",escapechar= "\\")

In [76]:
#display 5 rows of Books
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton & Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [77]:
books.shape

(271379, 8)

In [74]:
#display the ratings
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [78]:
ratings.shape

(1149780, 3)

In [79]:
#Code to organize a the ratings from 0-5
ratings.loc[:,'Book-Rating'] = 0
ratings.head(-1)

         User-ID        ISBN  Book-Rating
0         276725  034545104X            0
1         276726  0155061224            0
2         276727  0446520802            0
3         276729  052165615X            0
4         276729  0521795028            0
...          ...         ...          ...
1149774   276704  0876044011            0
1149775   276704  1563526298            0
1149776   276706  0679447156            0
1149777   276709  0515107662            0
1149778   276721  0590442449            0

[1149779 rows x 3 columns]

In [38]:
#display the users
users.head()

                                User-ID;"Location";"Age"
1;"nyc          new york                       usa";NULL
2;"stockton     california                     usa";"18"
3;"moscow       yukon territory             russia";NULL
4;"porto        v.n.gaia                  portugal";"17"
5;"farnborough  hants               united kingdom";NULL